app/models/concerns/current_cart.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2024-12-29 18:32:11.240425"], ["updated_at", "2024-12-29 18:32:11.240425"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "carts" SET "updated_at" = ?, "user_id" = ? WHERE "carts"."id" = ?  [["updated_at", "2024-12-29 19:28:03.788730"], ["user_id", 2], ["id", 2]]
---
    def set_cart
        @current_cart = Cart.find_by(id: session[:cart_id]) || Cart.create
        session[:cart_id] = @current_cart.id

        if user_signed_in? && @current_cart.user_id != current_user.id
          @current_cart.update(user: current_user)