app/views/carts/show.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 2]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 2]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? LIMIT ?  [["cart_id", 2], ["LIMIT", 1]]
---
    <h1 class="title is-3">Your Cart</h1>
    <% if @cart.cart_items.any? %>

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 3]]
---
        <tbody>
          <% @cart.cart_items.each do |item| %>