app/helpers/products_helper.rb

  def product_author(product)
    product.user.present? ? product.user.name : "Unknown"
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]