app/controllers/cart_items_controller.rb

    def create
      product = Product.find(params[:product_id])
      current_item = @current_cart.cart_items.find_by(product: product)

      if current_item
        current_item.increment(:quantity)
      else
        current_item = @current_cart.cart_items.build(product: product, quantity: 1)
      end

      current_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 2], ["product_id", 7], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 2], ["product_id", 7], ["quantity", 1], ["created_at", "2024-12-29 20:05:32.753799"], ["updated_at", "2024-12-29 20:05:32.753799"]]

    def destroy
      item = @current_cart.cart_items.find(params[:id])
      item.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["cart_id", 3], ["id", 4], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 4]]