app/controllers/carts_controller.rb

    def empty
      @current_cart.cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]