app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY created_at desc
---
  def index
    @products = Product.all.order("created_at desc")

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @products = Product.find(params[:id])

INSERT INTO "products" ("brand", "model", "description", "condition", "finish", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "brand" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["brand", "Fossil"], ["description", "A nice looking big water bottle"], ["updated_at", "2024-12-28 09:14:21.147509"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 6]]
---
def destroy
  if @product.destroy